{ "content": [
    {
        "type": "text_list",
        "header": "Overview",
        "content": [
            "This study was <b>published in NCUR 2014</b>, National Conference of Undergraduate Research.",
            "Created and tested visual learning tools for cognitive brain training and musical advancement",
            "<b>Highlights my attention to detail in evaluating a data graphic</b>, music notation"
        ]
    },
    {
        "type": "text_list",
        "header": "Thesis Summary",
        "content": [
            "Western music notation is generally intuitive, time reads left to right, and pitch up and down.",
            "<b>However, vertical spacing in Western music notation is inconsistent</b>, same amount of vertical space can represent whole or half notes",
            "Equal vertical space is given to major scale steps regardless of interval size."
        ]
    },
    {
        "type": "image2",
        "header": null,
        "content": [ "/western-music-notaion-figure4.png"]
    },
    {
        "type": "image2",
        "header": null,
        "content": [ "/western-music-notaion-figure5.png"]
    },
    {
        "type": "text_list",
        "header": "Hypothesis, Experiment, and Results",
        "content": [
            "<b>Proposed this inconsistency creates problems for ear training</b>, because the notation requires a high degree of familiarty with the major scale",
            "Created hypothetical alternative notation system, Circle Notation (CN), to address the issue noted for Western music notation",
            "Conducted an experiment with students with known levels of musical backgrounds",
            "Test consisted of <b>visual and audio questions</b>.",
            "Test <b>yielded significant results for students with novice or intermediate experience</b>, see exerpt question below with Traditional Notation (TN), Circle Notation (CN), also see results below"
        ]
    },
    {
        "type": "image2",
        "header": null,
        "content": [ "/westtern_music_notations_comparision.png"]
    },
    {
        "type": "image2",
        "header": null,
        "content": [ "/western-music-notaion-figure7.png"]
    }
   
]}