{ "content": [
    {
        "type": "text",
        "header": null,
        "content": [
            "I am happy to say that this article was published in Nightengale Magazine. It can be accessed online at the below link."
        ]
    },
    {
        "type": "component",
        "header": null,
        "content": [
            "MyLink",
            {
                "href": "https://nightingaledvs.com/woven-time/",
                "text": "https://nightingaledvs.com/woven-time/"
            }
        ]
    },
    {
        "type": "text",
        "header": null,
        "content": [            
            "The article summarizes the methodology for this data visualization, please visit the link to the publication to read about methodology. The interactive data visualization is unique to this page, as well as a couple of extra notes."
        ]
    },
    {
        "type": "text",
        "header": "Interactive section of 'Woven Time'",
        "content": [
            "The information about a song is synced to show up when it appears in the video. The song detail is synced to measure number, a music term for chunks of time. The timing of the sun in the video will be more precise than the entry of the song visual.",
            "Press play below the video, which is below on the left, to start. Use the video controls to scroll through the video. You can pause with the video controls too."
        ]
    },
    {
        "type": "component",
        "header": null,
        "content":["DataVisSection"]
    },
    {
        "type": "text",
        "header": "Extra Note: Extending samples that aren't heard, m32-36",
        "content": [
            "I think the section of the mashup from 1:50 to 2:04, or measures 32-36, particularly plays on our memories of the sample songs. There is a harmonious melodic relationship between the unheard extended samples and the heard samples.",
            "I hypothesized about this from my experience: though a sample ends, I found myself thinking about the next phrase from the original song."
        ]
    },
    {
        "type": "aside",
        "header": null,
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "To observe this musically, I created a version of this section with both the heard and unheard samples. I transcribed it as sheet music and exported it as an audio file."
                ]
            },
            {
                "type": "image",
                "header": null,
                "content": {
                    "title":"transcription of the mashup from meeasures 32-36",
                    "style": {
                        "height": "375px",
                        "maxWidth": "750px",
                        "backgroundImage":  "url('/transcriptionExtendedm31to36.png')",
                        "backgroundSize": "100%",
                        "backgroundRepeat": "no-repeat",
                        "backgroundPosition": "center",
                        "marginBottom": "4px"
                    }
                }
            },
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "Below are audio exports of my trancription, at two different speeds."
                ]
            },
            {
                "type": "component",
                "header": null,
                "content": [
                    "ExtendedSampleSoundCloud"
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "Extra Note: Lyrics that reference time",
        "content": [
            "The mashup's lyrics and visual content are linked to references to a linear timeframe, a work with a beginning, middle, and end. Most literally connected to the edges of a linear story, the visual content of the mashup signals beginnings and endings at the start and end of the track.",
            "The video opens with a flower blooming, a reference to a beginning or start, and ends with a digital clock counting down a few seconds to 0:00, signifying an end.",
            "The repetition of 'please don't stop the' rebels against the upcoming ending repeatedly, pushing to the height of the song's excitement. When the loop breaks, we enter a slower phase with a sense of mourning at the track's ending. Rihanna sings 'but it's over now', and Ryan Tedder from One Republic sings 'it's too late'.",
            "The energetic rebellion against the ending heightens the transition to the end. This end has suddenly lost its energy- to quote, 'it's over now' and 'it's too late'. It's also interesting that this rebellious sample uses the most 'overtime'.",
            "The trailing 'tonight [tonight]' through the middle of the mashup feels grounding to me, a call to the present moment, while at the same time an ironic jolt in time.",
            "I wanted to point these lyrics out because I'm curious about DJ Earworm's role as a creator and if he thought about time in this work. If it was a thought he had, did it translate and influence me and this visualization?"
        ]
    },
    {
        "type": "text",
        "header": "Thanks for reading!",
        "content": [
            "This is a passion projeect of mine, an expereimental data visualization.",
            "Hope you enjoyed"
        ]
    }
]}