{ "content": [
    {
        "type": "text",
        "header": null,
        "content": [
            "Our experience of time is simplest described like this- we move forward, and measure periods by units like seconds, minutes, hours, etc. But I don't really think that's all it is to us.",
            "Time is also very not simple. As an experience, not all hours or minutes feel like they are the same length. And when we reminisce about the past or flash to an imagined future, it's like we are transporting ourselves to a different moment. To me in some way, our brains experience that again.",
            "I do not mean to say that I do not live in a world where I gauge time linearly; I do prepare an hour ahead of time to get ready to catch a bus to work and I doset my lights to turn on when it gets dark outside. What I want to do here is to look at these meanings -the simple and not simple- simultaneously.",
            "That's where I ended up in this project, exploring this question of a variable time in a human experience. This is about an audio mashup and I hope that the data visualization itself is bound to the experience of a variable time."
        ]
    },
    {
        "type": "text",
        "header": "Overview",
        "content": [
            "This project explores our experience listening to an audio mashup. Mashups bring material together from different sources, and in this example, intended for an audience familiar with the source material. How do we process the pieces of this material brought together in a new form?",
            "A listener may relate to the source material emotionally, socially, or structurally, so I think there are many interesting ways to look at this question. This project's direction goes specifically into structural references, not because I think that is most important because it was the thought I wanted to pursue.",
            "I choose to look at this question for this mashup by the time position of the tracks. What is our experience of time when we have experienced the source material in time previously? Could I quantify samples by time placement and what would that show? The direction of this visualization is focused on the global position of the samples, or where they are in relation to the entire song. However, it would also be interesting to focus more locally, on where the samples are relative to a phrase or song section."
        ]
    },
    {
        "type": "text",
        "header": "Method",
        "content": [
            "In this exercise, I looked at 'The United State of Pop 2008', a mashup by DJ  Earworm that samples the top 25 songs in the United States in 2008.  The source material is chosen by popularity in a region, so familiarity  with the sourced songs is probably intended for the millions of people who streamed the songs.",
            "I collected data on placement to connect the use of the  sample in the mashup to the sample from the original song. This was based  on my ordered experience of listening to song tracks  repeatedly, and then later to the mashup.",
            "Song tracks are set to play for a period of time. The track begins,  plays, and ends; this process can repeat in exactly the same order. I 'could'  have formed some kind of memory of these songs over the course of the year,  because I listened to the radio in the United States and heard the chart-topping songs many times.  With this theory, I wanted to quantify then visualize how a mashup draws on  existing experiences to create a new experience from references. Specifically  based on ordered, time references from the original song tracks."
        ]
    },
    {
        "type": "text",
        "header": "Data Collection",
        "content": [
            "First I notated the segments of the mashup to gather each samples information, eg the song source, lyrics, and stop/start points. Then for each song source, I noted the number of samples and the order they were used in the mashup. I added this info in an Excel document manually. I used ELAN to store precise start and stop times, which so far has been used as a reference and not programatically."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "At this point in data collection, this information was gathered for the song 'No Air' by Jordin Sparks and Chris Brown."
                ]
            },
            {
                "type": "component",
                "header": null,
                "content": [
                    "SongDataTable",
                    {
                        "songId": "song3",
                        "columns":["lyrics"]
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "",
        "content": [
            "I reviewed where the samples appeared in the original song. This wasn't always a one-to-one match. For example, if a sample appeared in a chorus, it would repeat again (all of these songs have choruses, a pop song section). I therefore had some choices in how I collected the data. How would I discern where a sample appeared in the source song? I decided that order was important, because the experience of time is, as I understand, unstoppably moving forwards, so I decided to look for the samples in the source song in the same order that they appeeared in the mashup."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "At this point in data collection, this information was gathered for the song 'No Air' by Jordin Sparks ft Chris Brown."
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "SongDataTable",
                    {
                        "songId": "song3",
                        "columns":["lyrics", "sample_song_start"]
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "",
        "content": [
            "I would not go backwards, which could result in not finding a sample, running out of bounds, going ‘overtime’."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "For example, this happened in the song 'Bleeding Love'."
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "SongDataTable",
                    {
                        "songId": "song13",
                        "columns":["lyrics", "sample_song_start"]
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "",
        "content": [
            "I wanted to transform start times across the songs, because a sample appearance at 0:25 would mean something different depending on the length of the song (which typically ranged from 3 to 4 minutes).",
            "Using a proportion appeared to be a solution,  though it would be more precise than I wanted. As a percentage, values  would range from 1-100. Rounding and grouping could be done,  but I was not confident that the meaning would make sense across songs.",
            "Instead, I looked at the songs' other indicators of points of time. The songs consisted of similar sections, a journey familiar to pop music listeners.",
            "These pop songs flow through a pattern of pop song sections. They feature  song sections like verses and choruses. There can be more  nuanced sections like pre-chorus, post-chorus, and a refrain. I tracked  intros, verses, choruses, bridges, and outros. I did not track for example  a pre-chorus; I grouped it in another section if I heard it."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "'No Air' with transformed section data"
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "SongDataTable",
                    {
                        "songId": "song3",
                        "columns":["lyrics", "sample_song_start", "sample_song_section"]
                    }
                ]
            }
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "'Bleeding Love' with transformed section data"
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "SongDataTable",
                    {
                        "songId": "song13",
                        "columns":["lyrics", "sample_song_start", "sample_song_section"]
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "",
        "content": [
            "I chose a method with a goal of being objective, but definitely had discretion based on what I thought was important. This work is focused on the global position of the samples, or where they are in relation to the entire song. It also considers order as an important factor."
        ]
    },
    {
        "type": "text",
        "header": "Data Visualization",
        "content": [
            "The next part of this project transitioned to a data visualization. This data vis syncs the data to a visual of the sun at different points of the day. I thought it was a good unconscious relationship to a relative point in time&mdash;the beginning, middle, or end of a cycle.",
            "Essentially, the position of the sun is 'the time of day' of the sample in the source song. This is a rough translation, because the transformed data uses only 7 sun positions.",
            "Pictured below, are the seven sections of the day used in the visual, left to right, 1 to 7.",
            "There are two sun colors used. The first, more blue/white sun color, is used for instrumental samples, and the second, more orange sun color, is used for vocal samples."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "instrumental sample images"
                ]
            },
            { 
                "type": "image",
                "header": null,
                "content": {
                    "title": "Seven pictures of the white/blue sun, spaced at seven equal points of the day",
                    "style": {
                        "height": "50px",
                        "backgroundImage":  "url('/all_sun_positions_instrumental.png')",
                        "backgroundSize": "100%",
                        "backgroundRepeat": "no-repeat",
                        "backgroundPosition": "center",
                        "marginBottom": "4px"
                    }
                }
            },
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "vocal sample images"
                ]
            },
            { 
                "type": "image",
                "header": null,
                "content": {
                    "title": "Seven pictures of the orangee/yellow sun, spaced at seven equal points of the day",
                    "style": {
                        "height": "50px",
                        "backgroundImage":  "url('/all_sun_positions_vocal.png')",
                        "backgroundSize": "100%",
                        "backgroundRepeat": "no-repeat",
                        "backgroundPosition": "center"
                    }
                }
            }        
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "This is the mapping of the song sections to sun position (1-7). These are song sections that the samples are in, and then ordered based on the order of the 'Viva la Vida' track. This track is the main instrumental track and is sourced entirely, so I followed that order. It is also a common order of the sample songs."
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "DataTable",
                    {
                        "data": "songSectionMapping"
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "",
        "content": [
            "With this framework, this data visualization becomes a video. The sun visuals are synced to the mashup audio. It is named 'Woven Time', likening the composer's role to sewing time together."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "Below is an excerpt of the video without audio."
                ]
            },
            { 
                "type": "component",
                "header": null,
                "content": [
                    "YoutubeEmbed",
                    {
                        "embedId": "Du1K_IehRCM" 
                    }
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "Visual Representations for Sample Songs",
        "content": [
            "On this webpage, the video is linked to information about the sample songs. Each song has a visual representation of the data, for example the picture below."
        ]
    },
    {
        "type": "aside",
        "header": "",
        "content": [
            { 
                "type": "image",
                "header": null,
                "content": {
                    "title": "'Disturbia' by Rihanna song breakout with labels",
                    "style": {
                        "height": "250px",
                        "maxWidth": "500px",
                        "backgroundImage":  "url('/song_breakout_mapping.png')",
                        "backgroundSize": "100%",
                        "backgroundRepeat": "no-repeat",
                        "backgroundPosition": "center"
                    }
                }
            },
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "(A) song title",
                    "(B) song artist",
                    "(C) song's sample data transformed, sections 1-7 on horizontal linear track",
                    " -- sections (1 of 7) divided by black lines",
                    " -- sections show sun picture if the mashup uses a sample from this song at that time of day",
                    "(D) song's raw data, start to end on horizontal linear track",
                    " -- song sections are divided by black lines",
                    " -- samples are highlighted in purple and samples currently played in the video are green",
                    " (+) not pictured, popups with sample info are visible on mouse hover for sections in C and D"
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "Interactive section of 'Woven Time'",
        "content": [
            "The information about a song is synced to show up when it appears in the video. The song detail is synced to measure number, a music term for chunks of time. The timing of the sun in the video will be more precise than the entry of the song visual.",
            "Press play below the video, which is below on the left, to start. Use the video controls to scroll through the video. You can pause with the video controls too."
        ]
    },
    {
        "type": "component",
        "header": null,
        "content":["DataVisSection"]
    },
    {
        "type": "text",
        "header": "Extra Note: Extending samples that aren't heard, m32-36",
        "content": [
            "I think the section of the mashup from 1:50 to 2:04, or measures 32-36, particularly plays on our memories of the sample songs. There is a harmonious melodic relationship between the unheard extended samples and the heard samples.",
            "I hypothesized about this from my experience: though a sample ends, I found myself thinking about the next phrase from the original song."
        ]
    },
    {
        "type": "aside",
        "header": null,
        "content": [
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "To observe this musically, I created a version of this section with both the heard and unheard samples. I transcribed it as sheet music and exported it as an audio file."
                ]
            },
            {
                "type": "image",
                "header": null,
                "content": {
                    "title":"transcription of the mashup from meeasures 32-36",
                    "style": {
                        "height": "375px",
                        "maxWidth": "750px",
                        "backgroundImage":  "url('/transcriptionExtendedm31to36.png')",
                        "backgroundSize": "100%",
                        "backgroundRepeat": "no-repeat",
                        "backgroundPosition": "center",
                        "marginBottom": "4px"
                    }
                }
            },
            {
                "type": "aside_subtitle",
                "header": null,
                "content": [
                    "Below are audio exports of my transcription, at two different speeds."
                ]
            },
            {
                "type": "component",
                "header": null,
                "content": [
                    "ExtendedSampleSoundCloud"
                ]
            }
        ]
    },
    {
        "type": "text",
        "header": "Extra Note: Lyrics that reference time",
        "content": [
            "The mashup's lyrics and visual content are linked to references to a linear timeframe, a work with a beginning, middle, and end. Most literally connected to the edges of a linear story, the visual content of the mashup signals beginnings and endings at the start and end of the track.",
            "The video opens with a flower blooming, a reference to a beginning or start, and ends with a digital clock counting down a few seconds to 0:00, signifying an end.",
            "The repetition of 'please don't stop the' rebels against the upcoming ending repeatedly, pushing to the height of the song's excitement. When the loop breaks, we enter a slower phase with a sense of mourning at the track's ending. Rihanna sings 'but it's over now', and Ryan Tedder from One Republic sings 'it's too late'.",
            "The energetic rebellion against the ending heightens the transition to the end. This end has suddenly lost its energy- to quote, 'it's over now' and 'it's too late'. It's also interesting that this rebellious sample uses the most 'overtime'.",
            "The trailing 'tonight [tonight]' through the middle of the mashup feels grounding to me, a call to the present moment, while at the same time an ironic jolt in time.",
            "I wanted to point these lyrics out because I'm curious about DJ Earworm's role as a creator and if he thought about time in this work. If it was a thought he had, did it translate and influence me and this visualization?"
        ]
    },
    {
        "type": "text",
        "header": "Thanks for reading!",
        "content": [
            "This is a passion project of mine, an experimental data visualization.",
            "Hope you enjoyed"
        ]
    }
]}