{ "content": [
    {
        "type": "text_list",
        "header": null,
        "content":[
            "Full methodology for the data visualization is available at the publication link",
            "<b>Excited to say and thank you DVS, article published in Nightingale Magazine</b>, to dig further, the full methodology available online at <link>https://nightingaledvs.com/woven-time/</link>"
        ]
    },
    {
        "type": "text_list",
        "header": "***Interactive section of 'Woven Time'***",
        "content": [
            "This <b> interactive data visualization is unique to this page</b>, as well as a couple of extra notes.",
            "The information about a song is <b>synced to show when it appears in the video</b>, by measure number (a musical notation).",
            "<b>Press play</b> below the video, which is below on the left, to start."
        ]
    },
    {
        "type": "component",
        "header": null,
        "content":["DataVisSection"]
    },
    {
        "type": "text_list",
        "header": "Extra Note: Extending samples that aren't heard, m32-36",
        "content": [
            "During measures 32-36 of the mashup (1:50-2:04), the composition plays on listeners' musical memories.",
            "A <b>harmonious melodic relationship exists between heard samples and unheard extended samples</b>.",
            "The creator hypothesized that when a sample ends, listeners mentally continue the next phrase from the original song.",
            "This section particularly leverages this psychological effect, creating a musical experience that extends beyond what's explicitly played.",
            "To observe this musically, I musically notated this section with both the heard and unheard samples. Below the transcription, you can play audio files to hear this."
        ]
    },
    {
        "type": "image2",
        "header": null,
        "content": [ "/transcriptionExtendedm31to36.png"]
    },
    {
        "type": "component",
        "header": null,
        "content": [
            "ExtendedSampleSoundCloud"
        ]
    },
    {
        "type": "text_list",
        "header": "Mashup Time Theme Summary",
        "content": [
            "This analysis explores how the <b>artistic choices of this mashup reinforce a narrative timeframe</b> with clear beginning, middle, and end elements.",
            "Visual markers signal time progression- opening with a blooming flower (representing beginning) and ending with a digital countdown to 0:00 (representing conclusion)",
            "Lyrical content reinforces the time theme with - (1) repeated phrases 'please don't stop the' seeming resistance against the ending (2) transitions to slower tempo with Rihanna's 'but it's over now' and One Republic's 'it's too late' signaling acceptance of conclusion (3) The rebellious section paradoxically uses the most 'overtime' in the analysis in the composition (4) The recurring 'tonight [tonight]' throughout the mashup grounds listeners in the present moment and creates an ironic temporal displacement",
            "<b>The visualization explores whether DJ Earworm intentionally incorporated these time themes and if they influenced the creator's visualization approach.</b>"
        ]
    },
    {
        "type": "text_list",
        "header": "Thanks for reading!",
        "content": [
            "This is a <b>passion project</b> of mine, an experimental data visualization. Hope you enjoyed."
        ]
    }
]}