{ "content": [
    {
        "type": "text",
        "header": "Hi!",
        "content": [
            "I'm a <b>Senior Data Visualization Engineer</b>; I transform complex data into compelling visual stories that can improve understanding or drive business impact.",
            "I have over seven years of experience in Data Analytics and have experience in multiple engineering roles. I progressed to Senior Data Visualization Engineer, collaborating cross-functionally to <b>embed reporting in client-facing applications</b> and designing reports for internal use to aid business decisions.",
            "My interdisciplinary background is valuable to me as a unique perspective in my projects. Looking back at my time as a college undergraduate, I analyzed music notation and envisioned another method. Now I see this project coming full circle in a data visualization career as my 'first' data vis project."
        ]
    },
    {
        "type": "text",
        "header": "Where Technical Meets Creative",
        "content": [
            "My interdisciplinary background spans <b>data engineering, design, and music theory—a combination that gives me a unique perspective on how information can be structured, analyzed, and communicated</b>. (I hold an MA in Music Theory & Cognition) This foundation taught me to see patterns, understand user experience, and think systematically about complex problems.",
            "What started as <b>analyzing music notation as an undergraduate—essentially my first data visualization project</b>—has come full circle into a career where I blend technical expertise with creative problem-solving.", 
            "I have built and maintained data pipelines, managed reporting (BI) systems supporting many users, and developed custom visualizations for the web or with dashboarding tools that can make data accessible to non-technical stakeholders."
        ]
    },
    {
        "type": "text_list",
        "header": "Professional Impact",
        "content": [
            "<b>Vendor Scorecard Development</b>: Designed and embedded external vendor scorecards in client applications, creating clear performance metrics and accountability",
            "<b>Business Impact</b>: Generated project savings within the first half year of external reporting",
            "<b>BI Management</b>: Manage business intelligence systems supporting 70+ users across multiple departments",
            "<b>Data Pipeline Engineering</b>: Build and maintain automated data pipelines using Python, AWS services, and DBT for ETL processes",
            "<b>Cross-functional Collaboration</b>: Work closely with data scientists, account managers, and stakeholders to translate business needs into technical solutions",
            "<b>Internal Mapping Tools</b>: Developed React components and implemented style guides for asset mapping software",
            "<b>Process Automation</b>: Created applications to automate PowerPoint slide generation and PDF creation, reducing manual work for non-technical teams",
            "<b>Data Quality Management</b>: Maintained legacy SQL ELT processes while transitioning to modern DBT workflows",
            "<b>User-Centered Design</b>: Focus on solutions that genuinely improve workflows and user experiences"
        ]
    },
    {
        "type": "text",
        "header": "What's next?",
        "content": [
            "<b>Data visualization sits at this fascinating intersection of technical and design skills</b>, and I'm still exploring what balance will suit me best. What I know for certain is that I love solving complex problems, making data accessible, and creating solutions that have real impact.",
            "My interests include:"

        ]
    },
    {
        "type": "text_list",
        "content": [
            "<b>Problem-Solving</b>: Automating tedious processes and designing intuitive interfaces",
            "<b>Storytelling</b>: Finding new ways to tell compelling stories with data",
            "<b>Innovation</b>: Combining analytical rigor with creative thinking to develop unique solutions",
            "<b>Impact</b>: Creating work that measurably improves business outcomes and user experiences"
        ]
    },
        {
        "type": "text",
        "content": [

            "When I'm not working, you'll find me reading, watching great shows, at yoga, or learning chess. I'm also hoping to get back into painting—because sometimes the unexpected solutions come when you step away from the screen and work with your hands."
        ]
    },
    {
        "type": "text",
        "header": "Connect with me",
        "content": [
            "Connect with me on LinkedIn or Github:"
        ]
    },
    {
        "type": "component",
        "header": null,
        "content":["MyPlatformHandles"]
    }
]}